type Content = {
  [key: string]: string[]
}

export const content: Content = {
  '横':[
    '/image/g.png',
    '/image/f.png',
    '/image/d.png',
    '/image/s.png',
    '/image/a.png',
  ],
  '竖':[
    '/image/h.png',
    '/image/j.png',
    '/image/k.png',
    '/image/l.png',
    '/image/m.png',
  ],
  '撇':[
    '/image/t.png',
    '/image/r.png',
    '/image/e.png',
    '/image/w.png',
    '/image/q.png',
  ],
  '捺':[
    '/image/y.png',
    '/image/u.png',
    '/image/i.png',
    '/image/o.png',
    '/image/p.png',
  ],
  '折':[
    '/image/x.png',
    '/image/c.png',
    '/image/v.png',
    '/image/b.png',
    '/image/n.png',
  ],
}

export const zigeng = {
  'g':['', '', '', '', ''],
  'f':['', '', '', '', ''],
  'd':['', '', '', '', ''],
  's':['', '', '', '', ''],
  'a':['', '', '', '', ''],
  'h':['', '', '', '', ''],
  'j':['', '', '', '', ''],
  'k':['', '', '', '', ''],
  'l':['', '', '', '', ''],
  'm':['', '', '', '', ''],
  't':['', '', '', '', ''],
  'r':['', '', '', '', ''],
  'e':['', '', '', '', ''],
  'w':['', '', '', '', ''],
  'q':['', '', '', '', ''],
  'y':['', '', '', '', ''],
  'u':['', '', '', '', ''],
  'i':['', '', '', '', ''],
  'o':['', '', '', '', ''],
  'p':['', '', '', '', ''],
  'x':['', '', '', '', ''],
  'c':['', '', '', '', ''],
  'v':['', '', '', '', ''],
  'b':['', '', '', '', ''],
  'n':['', '', '', '', ''],
}

export const jiqiao: Content = {
  '打字技巧，四笔成':[
    '两字词组 ，分别取每个字的头两笔即可',
    '三字词组 ，取头两个字的第一笔和第三个字的头两笔',
    '四字词组 ，每个字的第一笔',
    '多字词组， 头三个字的第一笔和最后一个字的第一笔',
    '例如：＂你＂ 用五笔打编码是： wqiy',
    '例如：＂我的＂ 用五笔打编码是： trrq',
    '例如：＂幼儿园＂ 用五笔打编码是： qlf',
    '例如：＂弄虚作假＂ 用五笔打编码是： ghww',
    '例如：＂搬起石头砸自己的脚＂ 用五笔打编码是： rfde',
  ],
  '高频字25个 ，对应的分区中的键击打一下':[
    '和的有人我',
    '主产不为这',
    '一地在要工',
    '上是中国同',
    '民了发以经',
  ],
  '笔画分区，字型判位':[
    '在五笔字根表中，汉字的字型可分为三类：',
    '第一类左右型。如图一所示。例字：汉、始、倒。',
    '第二类上下型。如图二所示。例字：字、型、森、器。',
    '第三类杂合型。如图三所示。例字：国、这、函、问、句。',
    '有一些由两个或多个字根相交而成的字，也属于第三类。',
    '例如：“必”字是由字根“心”和“丿”组成的；',
    '“毛”字是由“丿”“二”和“乚”组成的。',
  ],
  '拆分原则':[
    '取大优先，兼顾直观，能连不交，能散不连',
    '取大优先：字根尽量大，数量少',
    '能连不交：相连不相交',
    '能散不连：分散不相连',
    '连：单笔画与字根相连',
    '交：字根互相交叉',
  ],
}
